diplom-src/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ВКМ_Подразделения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/InformationRegisters/ВКМ_ГрафикиОтпусков/ВКМ_ГрафикиОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ГрафикиОтпусков</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

diplom-src/src/Documents/ВКМ_ГрафикОтпусков/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда  
    
#Область ОбработчикиСобытийМодуляОбъекта

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
    
    Для каждого Строка Из ОтпускаСотрудников Цикл   
        
        Если ЗначениеЗаполнено (Строка.ДатаНачала) И ЗначениеЗаполнено(Строка.ДатаОкончания) Тогда 
            Если Строка.ДатаНачала > Строка.ДатаОкончания Тогда  
                Сообщить(СтрШаблон("Неверно заполнен период в строке №%1", Строка.НомерСтроки)); 
                Отказ = Истина; 
            КонецЕсли; 
        КонецЕсли; 
    КонецЦикла;
    
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Набор = РегистрыСведений.ВКМ_ГрафикиОтпусков.СоздатьНаборЗаписей(); 
	Сутки = 60*60*24; 
	
	Для каждого Строка Из ОтпускаСотрудников Цикл
	    День = Строка.ДатаНачала; 
		Пока День < Строка.ДатаОкончания +1 Цикл
		   НоваяЗапись = Набор.Добавить(); 
		   НоваяЗапись.Дата = День; 
		   НоваяЗапись.Сотрудник = Строка.Сотрудник; 
		   НоваяЗапись.Значение = 1; 
		   День = День + Сутки; 
		КонецЦикла;
	КонецЦикла;    
	
	Набор.Записать(Ложь); 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
